Revit.Elements.InternalUtilities.ElementUtils.GetParameterType(Revit.Elements.Parameter)
Get data type of parameter value, or based on its StorageType if value is null
parameter:
Returns:
Throws ApplicationException: